export const ErrorCodeMap = {
  //5000-9999  认证相关错误
  5000:"账号或密码错误",
  5001:"验证码错误",
  // 10000 - 99999 业务操作错误
  10000:"没有该父级模块",
  10001:"模块不存在",
  10002:"用户名已存在",
  10003:"用户不存在",
  10004:"id不能为空",
  10005:"id为字符串的数字",
  10006:"没有该购物车的id",
  10007:"购物车数据已经存在请不要重复创建",
  10008:"id必须为数字",
  10009:"没有该产品",
  10010:"没有该产品的详情",
  10011:"当前购物车没有该购物车商品的具体信息",
  10012:"超出当前商品的库存数量",
  
  // 100000 - 110000 业务操作成功提示
  100000:"新增成功",
  100001:"删除成功",
  100002:"更新成功",
  100003:"修改成功",
}

export type ErrorCodeMapType = keyof typeof ErrorCodeMap
